## __Importing and Exporting Data in Python__

 We'll cover the following methods in pandas:
1. Writing JSON
2. Reading JSON
3. Writing Excel
4. Reading Excel
5. Writing gzip files
6. Reading gzip files

## Step 1: Import Pandas

In [1]:
import pandas as pd

## Step 2: Read the CSV File

- Read the CSV file using the pd.read_csv() function:

In [2]:
df = pd.read_csv('../../Datasets/Sample_dataO.csv')

## Step 3: Display the First Few Rows

- Display the first few rows of the DataFrame using the .head() method:

In [3]:
df.head()

       name  age location    phpref
0      john   35  germany    iphone
1      mary   23   france  motorola
2    johnie   40  germany   samsung
3  Aarbhiii   27    italy    iphone
4      Gane   20  Romania      sony

__Observation__

- These are the contents of the CSV file.

## Step 4: Write a JSON File

- Write the DataFrame to a JSON file using the .to_json() method:

In [5]:
df.to_json('Sample_dataO_json.json')

## Step 5: Read the JSON File

- Read the JSON file using the pd.read_json() function:

In [4]:
df = pd.read_json('Sample_dataO_json.json')

## Step 6: Display the DataFrame

- Display the DataFrame:

In [5]:
df

       name  age location    phpref
0      john   35  germany    iphone
1      mary   23   france  motorola
2    johnie   40  germany   samsung
3  Aarbhiii   27    italy    iphone
4      Gane   20  Romania      sony
5  Aarbhiii   27    italy    iphone

## Step 7: Write to an Excel File

- Write the DataFrame to an Excel file using the .to_excel() method:

In [10]:
#pip install openpyxl
df.to_excel('Sample_dataO_Excel.xlsx',index = False)

## Step 8: Read an Excel File

- Read the Excel file using the pd.read_excel() function:

In [12]:
df = pd.read_excel('Sample_dataO_Excel.xlsx')

## Step 9: Display the DataFrame

- Display the DataFrame:

In [13]:
df

       name  age location    phpref
0      john   35  germany    iphone
1      mary   23   france  motorola
2    johnie   40  germany   samsung
3  Aarbhiii   27    italy    iphone
4      Gane   20  Romania      sony
5  Aarbhiii   27    italy    iphone

## Step 10: Write to a GZIP File

- Write the DataFrame to a GZIP file using the .to_csv() method with **compression=gzip**:

In [14]:
df.to_csv('SampleFilegzip.gz',compression='gzip',index = False)

## Step 11: Read the GZIP File

- Read the GZIP file using the pd.read_csv() function:

In [15]:
df = pd.read_csv('SampleFilegzip.gz')

## Step 12: Display the DataFrame

- Display the DataFrame:

In [16]:
df

       name  age location    phpref
0      john   35  germany    iphone
1      mary   23   france  motorola
2    johnie   40  germany   samsung
3  Aarbhiii   27    italy    iphone
4      Gane   20  Romania      sony
5  Aarbhiii   27    italy    iphone